; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-2-29)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-6 - location
	p0-7 - location
	p0-8 - location
	p1-0 - location
	p1-4 - location
	p2-5 - location
	p2-8 - location
	p3-2 - location
	p3-6 - location
	p4-3 - location
	p4-9 - location
	p7-5 - location
	p7-9 - location
	p8-1 - location
	p8-5 - location
	p8-6 - location
	p8-9 - location
	p9-0 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s6)
	(at driver4 s8)
	(at driver5 s9)
	(at driver6 s9)
	(at driver7 s6)
	(at driver8 s2)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at package1 s1)
	(at package2 s9)
	(at package3 s9)
	(at package4 s7)
	(at package5 s7)
	(at package6 s0)
	(at package7 s4)
	(at package8 s4)
	(at package9 s8)
	(at package10 s1)
	(at package11 s4)
	(at package12 s2)
	(at package13 s0)
	(at package14 s2)
	(at package15 s5)
	(at package16 s3)
	(at package17 s8)
	(at package18 s5)
	(at package19 s5)
	(at package20 s6)
	(at package21 s2)
	(at package22 s6)
	(at package23 s1)
	(at package24 s4)
	(at package25 s3)
	(at package26 s8)
	(at package27 s8)
	(at package28 s1)
	(at package29 s7)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s6)
	(link s6 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s7)
	(link s7 s1)
	(link s1 s8)
	(link s8 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s6)
	(link s6 s2)
	(link s2 s9)
	(link s9 s2)
	(link s3 s8)
	(link s8 s3)
	(link s3 s9)
	(link s9 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s9)
	(link s9 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s7)
	(link s7 s5)
	(link s5 s8)
	(link s8 s5)
	(link s6 s4)
	(link s4 s6)
	(link s7 s4)
	(link s4 s7)
	(link s8 s0)
	(link s0 s8)
	(link s9 s0)
	(link s0 s9)
	(link s9 s5)
	(link s5 s9)
	(link s9 s6)
	(link s6 s9)
	(link s9 s7)
	(link s7 s9)
)
	(:goal (and
	(at driver1 s4)
	(at driver3 s4)
	(at driver5 s5)
	(at driver6 s5)
	(at driver7 s2)
	(at driver8 s3)
	(at truck1 s0)
	(at truck2 s4)
	(at package1 s7)
	(at package2 s1)
	(at package3 s7)
	(at package4 s6)
	(at package5 s6)
	(at package6 s5)
	(at package7 s1)
	(at package8 s4)
	(at package9 s0)
	(at package10 s3)
	(at package11 s5)
	(at package12 s4)
	(at package13 s4)
	(at package14 s1)
	(at package15 s8)
	(at package17 s3)
	(at package18 s7)
	(at package19 s6)
	(at package20 s7)
	(at package21 s2)
	(at package22 s4)
	(at package23 s4)
	(at package24 s7)
	(at package25 s2)
	(at package26 s6)
	(at package27 s5)
	(at package28 s0)
	(at package29 s5)
	))


)

; plan
1. (board-truck driver2 s3 truck2)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 36
2. (board-truck driver3 s6 truck1)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 36
3. (drive-truck driver2 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 2 of 36
4. (drive-truck driver2 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 2 of 36
5. (drive-truck driver2 s5 s8 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   goals met: 2 of 36
6. (walk driver1 s2 p3-2)
   deleted: (at driver1 s2)
   added: (at driver1 p3-2)
   goals met: 2 of 36
7. (walk driver1 p3-2 s3)
   deleted: (at driver1 p3-2)
   added: (at driver1 s3)
   goals met: 2 of 36
8. (walk driver1 s3 p4-3)
   deleted: (at driver1 s3)
   added: (at driver1 p4-3)
   goals met: 2 of 36
9. (walk driver1 p4-3 s4)
   deleted: (at driver1 p4-3)
   added: (at driver1 s4)
   goals met: 3 of 36
10. (drive-truck driver3 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 3 of 36
11. (drive-truck driver3 s4 s9 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   goals met: 3 of 36
12. (drive-truck driver2 s8 s1 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   goals met: 3 of 36
13. (walk driver7 s6 p8-6)
   deleted: (at driver7 s6)
   added: (at driver7 p8-6)
   goals met: 3 of 36
14. (walk driver7 p8-6 s8)
   deleted: (at driver7 p8-6)
   added: (at driver7 s8)
   goals met: 3 of 36
15. (walk driver7 s8 p2-8)
   deleted: (at driver7 s8)
   added: (at driver7 p2-8)
   goals met: 3 of 36
16. (walk driver7 p2-8 s2)
   deleted: (at driver7 p2-8)
   added: (at driver7 s2)
   goals met: 4 of 36
17. (walk driver8 s2 p3-2)
   deleted: (at driver8 s2)
   added: (at driver8 p3-2)
   goals met: 4 of 36
18. (walk driver8 p3-2 s3)
   deleted: (at driver8 p3-2)
   added: (at driver8 s3)
   goals met: 5 of 36
19. (load-truck s9 package3 truck1)
   deleted: (at package3 s9)
   added: (in package3 truck1)
   goals met: 5 of 36
20. (drive-truck driver3 s9 s0 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s0)
   goals met: 6 of 36
21. (walk driver5 s9 p8-9)
   deleted: (at driver5 s9)
   added: (at driver5 p8-9)
   goals met: 6 of 36
22. (walk driver5 p8-9 s8)
   deleted: (at driver5 p8-9)
   added: (at driver5 s8)
   goals met: 6 of 36
23. (walk driver5 s8 p8-5)
   deleted: (at driver5 s8)
   added: (at driver5 p8-5)
   goals met: 6 of 36
24. (walk driver5 p8-5 s5)
   deleted: (at driver5 p8-5)
   added: (at driver5 s5)
   goals met: 7 of 36
25. (walk driver6 s9 p8-9)
   deleted: (at driver6 s9)
   added: (at driver6 p8-9)
   goals met: 7 of 36
26. (walk driver6 p8-9 s8)
   deleted: (at driver6 p8-9)
   added: (at driver6 s8)
   goals met: 7 of 36
27. (walk driver6 s8 p8-5)
   deleted: (at driver6 s8)
   added: (at driver6 p8-5)
   goals met: 7 of 36
28. (walk driver6 p8-5 s5)
   deleted: (at driver6 p8-5)
   added: (at driver6 s5)
   goals met: 8 of 36
29. (load-truck s0 package6 truck1)
   deleted: (at package6 s0)
   added: (in package6 truck1)
   goals met: 8 of 36
30. (load-truck s0 package13 truck1)
   deleted: (at package13 s0)
   added: (in package13 truck1)
   goals met: 8 of 36
31. (drive-truck driver3 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 7 of 36
32. (drive-truck driver3 s5 s7 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   goals met: 7 of 36
33. (load-truck s7 package5 truck1)
   deleted: (at package5 s7)
   added: (in package5 truck1)
   goals met: 7 of 36
34. (drive-truck driver3 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 7 of 36
35. (drive-truck driver3 s4 s9 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   goals met: 7 of 36
36. (load-truck s9 package2 truck1)
   deleted: (at package2 s9)
   added: (in package2 truck1)
   goals met: 7 of 36
37. (drive-truck driver3 s9 s4 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   goals met: 7 of 36
38. (load-truck s4 package7 truck1)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   goals met: 7 of 36
39. (load-truck s4 package24 truck1)
   deleted: (at package24 s4)
   added: (in package24 truck1)
   goals met: 7 of 36
40. (drive-truck driver3 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 7 of 36
41. (load-truck s7 package4 truck1)
   deleted: (at package4 s7)
   added: (in package4 truck1)
   goals met: 7 of 36
42. (unload-truck s7 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s7)
   goals met: 8 of 36
43. (drive-truck driver3 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 8 of 36
44. (unload-truck s4 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s4)
   goals met: 9 of 36
45. (drive-truck driver3 s4 s9 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   goals met: 9 of 36
46. (load-truck s1 package28 truck2)
   deleted: (at package28 s1)
   added: (in package28 truck2)
   goals met: 9 of 36
47. (drive-truck driver2 s1 s8 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   goals met: 9 of 36
48. (drive-truck driver3 s9 s6 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s6)
   goals met: 9 of 36
49. (unload-truck s6 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s6)
   goals met: 10 of 36
50. (unload-truck s6 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s6)
   goals met: 11 of 36
51. (drive-truck driver3 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 11 of 36
52. (drive-truck driver3 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 11 of 36
53. (unload-truck s1 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 12 of 36
54. (load-truck s1 package23 truck1)
   deleted: (at package23 s1)
   added: (in package23 truck1)
   goals met: 12 of 36
55. (unload-truck s1 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 13 of 36
56. (drive-truck driver3 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 13 of 36
57. (drive-truck driver3 s4 s9 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   goals met: 13 of 36
58. (load-truck s8 package9 truck2)
   deleted: (at package9 s8)
   added: (in package9 truck2)
   goals met: 13 of 36
59. (load-truck s8 package27 truck2)
   deleted: (at package27 s8)
   added: (in package27 truck2)
   goals met: 13 of 36
60. (load-truck s8 package26 truck2)
   deleted: (at package26 s8)
   added: (in package26 truck2)
   goals met: 13 of 36
61. (drive-truck driver2 s8 s5 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   goals met: 13 of 36
62. (drive-truck driver3 s9 s4 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   goals met: 13 of 36
63. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 13 of 36
64. (drive-truck driver3 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 13 of 36
65. (load-truck s7 package29 truck1)
   deleted: (at package29 s7)
   added: (in package29 truck1)
   goals met: 13 of 36
66. (unload-truck s7 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s7)
   goals met: 14 of 36
67. (unload-truck s0 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s0)
   goals met: 15 of 36
68. (unload-truck s0 package28 truck2)
   deleted: (in package28 truck2)
   added: (at package28 s0)
   goals met: 16 of 36
69. (drive-truck driver2 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 16 of 36
70. (drive-truck driver3 s7 s5 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 16 of 36
71. (unload-truck s5 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 17 of 36
72. (unload-truck s5 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s5)
   goals met: 18 of 36
73. (load-truck s5 package19 truck1)
   deleted: (at package19 s5)
   added: (in package19 truck1)
   goals met: 18 of 36
74. (drive-truck driver3 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 18 of 36
75. (drive-truck driver2 s6 s4 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   goals met: 19 of 36
76. (load-truck s3 package25 truck1)
   deleted: (at package25 s3)
   added: (in package25 truck1)
   goals met: 19 of 36
77. (load-truck s4 package11 truck2)
   deleted: (at package11 s4)
   added: (in package11 truck2)
   goals met: 19 of 36
78. (drive-truck driver2 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 18 of 36
79. (drive-truck driver3 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 18 of 36
80. (drive-truck driver2 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 18 of 36
81. (drive-truck driver2 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 18 of 36
82. (unload-truck s2 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s2)
   goals met: 19 of 36
83. (drive-truck driver3 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 19 of 36
84. (load-truck s6 package22 truck1)
   deleted: (at package22 s6)
   added: (in package22 truck1)
   goals met: 19 of 36
85. (load-truck s6 package20 truck1)
   deleted: (at package20 s6)
   added: (in package20 truck1)
   goals met: 19 of 36
86. (drive-truck driver3 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 19 of 36
87. (unload-truck s4 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s4)
   goals met: 20 of 36
88. (drive-truck driver3 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 20 of 36
89. (load-truck s1 package10 truck1)
   deleted: (at package10 s1)
   added: (in package10 truck1)
   goals met: 20 of 36
90. (drive-truck driver3 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 20 of 36
91. (load-truck s2 package14 truck1)
   deleted: (at package14 s2)
   added: (in package14 truck1)
   goals met: 20 of 36
92. (drive-truck driver3 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 20 of 36
93. (drive-truck driver3 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 20 of 36
94. (unload-truck s4 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s4)
   goals met: 21 of 36
95. (unload-truck s5 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s5)
   goals met: 22 of 36
96. (load-truck s5 package18 truck2)
   deleted: (at package18 s5)
   added: (in package18 truck2)
   goals met: 22 of 36
97. (load-truck s5 package15 truck2)
   deleted: (at package15 s5)
   added: (in package15 truck2)
   goals met: 22 of 36
98. (unload-truck s5 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s5)
   goals met: 23 of 36
99. (drive-truck driver2 s5 s8 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   goals met: 23 of 36
100. (load-truck s8 package17 truck2)
   deleted: (at package17 s8)
   added: (in package17 truck2)
   goals met: 23 of 36
101. (drive-truck driver2 s8 s0 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   goals met: 23 of 36
102. (drive-truck driver2 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 23 of 36
103. (unload-truck s3 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s3)
   goals met: 24 of 36
104. (drive-truck driver2 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 25 of 36
105. (drive-truck driver2 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 24 of 36
106. (unload-truck s6 package26 truck2)
   deleted: (in package26 truck2)
   added: (at package26 s6)
   goals met: 25 of 36
107. (drive-truck driver2 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 25 of 36
108. (drive-truck driver2 s0 s7 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   goals met: 25 of 36
109. (unload-truck s7 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s7)
   goals met: 26 of 36
110. (drive-truck driver2 s7 s4 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   goals met: 27 of 36
111. (drive-truck driver2 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 26 of 36
112. (drive-truck driver2 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 26 of 36
113. (load-truck s2 package12 truck2)
   deleted: (at package12 s2)
   added: (in package12 truck2)
   goals met: 26 of 36
114. (drive-truck driver2 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 26 of 36
115. (drive-truck driver2 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 27 of 36
116. (unload-truck s4 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s4)
   goals met: 28 of 36
117. (drive-truck driver2 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 27 of 36
118. (drive-truck driver2 s3 s8 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   goals met: 27 of 36
119. (unload-truck s8 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s8)
   goals met: 28 of 36
120. (drive-truck driver2 s8 s3 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s3)
   goals met: 28 of 36
121. (drive-truck driver2 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 29 of 36
122. (drive-truck driver3 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 29 of 36
123. (unload-truck s1 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s1)
   goals met: 30 of 36
124. (drive-truck driver3 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 30 of 36
125. (drive-truck driver3 s4 s9 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   goals met: 30 of 36
126. (drive-truck driver2 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 29 of 36
127. (load-truck s1 package1 truck2)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   goals met: 29 of 36
128. (drive-truck driver2 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 30 of 36
129. (drive-truck driver2 s4 s7 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s7)
   goals met: 29 of 36
130. (unload-truck s7 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s7)
   goals met: 30 of 36
131. (drive-truck driver2 s7 s4 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   goals met: 31 of 36
132. (drive-truck driver3 s9 s3 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s3)
   goals met: 31 of 36
133. (unload-truck s3 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s3)
   goals met: 32 of 36
134. (drive-truck driver3 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 33 of 36
135. (drive-truck driver3 s0 s6 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   goals met: 32 of 36
136. (unload-truck s6 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s6)
   goals met: 33 of 36
137. (drive-truck driver3 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 34 of 36
138. (drive-truck driver3 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 33 of 36
139. (unload-truck s7 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s7)
   goals met: 34 of 36
140. (drive-truck driver3 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 35 of 36
141. (disembark-truck driver3 s0 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 35 of 36
142. (walk driver3 s0 p9-0)
   deleted: (at driver3 s0)
   added: (at driver3 p9-0)
   goals met: 35 of 36
143. (walk driver3 p9-0 s9)
   deleted: (at driver3 p9-0)
   added: (at driver3 s9)
   goals met: 35 of 36
144. (walk driver3 s9 p4-9)
   deleted: (at driver3 s9)
   added: (at driver3 p4-9)
   goals met: 35 of 36
145. (walk driver3 p4-9 s4)
   deleted: (at driver3 p4-9)
   added: (at driver3 s4)
   goals met: 36 of 36
